merge
concate
append

join

In [1]:
d1={'ID':[101,104,102,105,103],
   'Name':['A','B','C','D','E'],
   'sal':['12k','15k','13k','17k','20k']}

In [3]:
d2={'ID':[1011,1041,1021,1051,1031],
   'Name':['A','B','C','D','E'],
    'sal':['120k','150k','130k','170k','200k']}

In [16]:
import pandas as pd
df1=pd.DataFrame(d1)

In [17]:
df2=pd.DataFrame(d2)

In [18]:
df1.append(df2)

    ID Name   sal
0  101    A   12k
1  104    B   15k
2  102    C   13k
3  105    D   17k
4  103    E   20k
0  101   AX  100k
1  104   BY  105k
2  108   BZ  104k
3  107   AX  103k
4  106   BY  105k


merge

In [26]:
d1

{'ID': [101, 104, 102, 105, 103],
 'Name': ['A', 'B', 'C', 'D', 'E'],
 'sal': ['12k', '15k', '13k', '17k', '20k']}

In [12]:
d2={'ID':[101,104,108,107,106],
   'Name':['AX','BY','BZ','AX','BY'],
           'sal':['100k','105k','104k','103k','105k']}

In [27]:
df1=pd.DataFrame(d1)

In [28]:
df2=pd.DataFrame(d2)

In [29]:
pd.merge(left=df1,right=df2,how='outer')

    ID Name   sal
0  101    A   12k
1  104    B   15k
2  102    C   13k
3  105    D   17k
4  103    E   20k
5  101   AX  100k
6  104   BY  105k
7  108   BZ  104k
8  107   AX  103k
9  106   BY  105k

In [30]:
pd.merge(left=df1,right=df2,how='inner')

Empty DataFrame
Columns: [ID, Name, sal]
Index: []

In [31]:
pd.merge(left=df1,right=df2,how='right')

    ID Name   sal
0  101   AX  100k
1  104   BY  105k
2  108   BZ  104k
3  107   AX  103k
4  106   BY  105k

In [32]:
pd.merge(left=df1,right=df2,how='left')

    ID Name  sal
0  101    A  12k
1  104    B  15k
2  102    C  13k
3  105    D  17k
4  103    E  20k

In [33]:
df1

    ID Name  sal
0  101    A  12k
1  104    B  15k
2  102    C  13k
3  105    D  17k
4  103    E  20k